app/views/lists/_list.html.erb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."created_at" DESC LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<% @list = list %>
<% @item = Item.find(list.item_id) %>
<% user = User.find(list.from_user_id) %>