app/views/favorites/_favorite.html.erb

<% @item = Item.find(favorite.item_id) %>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."created_at" DESC LIMIT ?  [["id", 9], ["LIMIT", 1]]