app/views/comments/_feed_comments.html.erb

SELECT "comments".* FROM "comments" WHERE (item_id = 5)
SELECT COUNT(*) FROM "comments" WHERE "comments"."item_id" = ?  [["item_id", 5]]
---
  <div class="col-md-12">
    <h3 class="title-comment">コメント (<%= "#{@item.comments.count}" %>)</h3>