app/views/notifications/_notification.html.erb

<% user = User.find(notification.from_user_id) %>
<% item = Item.find(notification.item_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 102], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."created_at" DESC LIMIT ?  [["id", 10], ["LIMIT", 1]]