app/views/users/_unlist.html.erb

<% list = List.find_by(item_id: @item.id) %>
---
SELECT  "lists".* FROM "lists" WHERE "lists"."item_id" = ? ORDER BY "lists"."created_at" DESC LIMIT ?  [["item_id", 10], ["LIMIT", 1]]