app/views/users/show.html.erb

    <div class="col-md-9">
      <% if @user.items.any? %>
        <h3>アイテム (<%= @user.items.count %>)</h3>
---
SELECT  1 AS one FROM "items" WHERE "items"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]