app/views/users/show_follow.html.erb

SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
---
      <span><%= link_to "プロフィール", @user %></span>
      <span><b>アイテム</b><%= @user.items.count %><b>件</b></span>