app/views/items/_item.html.erb

      <span>
        <%= link_to((image_tag item.picture.thumb200.url), item_path(item.id), class: 'item-picture') if item.picture.url.present? %>
---
SELECT  "items".* FROM "items" WHERE (user_id IN (SELECT followed_id FROM relationships

      <div class="item-other-info">
        <span class="buy_times">買った回数：<%= item.logs.count %>回　</span>
---
SELECT COUNT(*) FROM "logs" WHERE "logs"."item_id" = ?  [["item_id", 13]]