app/views/items/show.html.erb

SELECT "genres".* FROM "genres" WHERE "genres"."item_id" = ?  [["item_id", 13]]
---
              <table class="genre">
                <% @item.genres.each do |i| %>

SELECT COUNT(*) FROM "logs" WHERE "logs"."item_id" = ?  [["item_id", 13]]
---
          <div class="item-info">
            <h5>買った回数：</h5><h4><%= @item.logs.count %></h4> <h5>回</h5>