app/controllers/comments_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."created_at" DESC LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("item_id", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 5], ["user_id", 1], ["content", "いいですね"], ["created_at", "2020-12-14 06:38:32.435558"], ["updated_at", "2020-12-14 06:38:32.435558"]]
INSERT INTO "notifications" ("user_id", "item_id", "variety", "content", "from_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["item_id", 10], ["variety", 2], ["content", "いいですね！"], ["from_user_id", 102], ["created_at", "2020-12-14 14:05:58.394150"], ["updated_at", "2020-12-14 14:05:58.394150"]]
---
  def create
    @item = Item.find(params[:item_id])
    @user = @item.user
    @comment = @item.comments.build(user_id: current_user.id, content: params[:comment][:content])
    if !@item.nil? && @comment.save
      flash[:success] = "コメントを追加しました！"
      # 自分以外のユーザーからコメントがあったときのみ通知を作成
      if @user != current_user
        @user.notifications.create(item_id: @item.id, variety: 2,
                                   from_user_id: current_user.id,
                                   content: @comment.content) # コメントは通知種別2