app/controllers/favorites_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."created_at" DESC LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["item_id", 10], ["created_at", "2020-12-14 02:03:34.067052"], ["updated_at", "2020-12-14 02:03:34.067052"]]
INSERT INTO "notifications" ("user_id", "item_id", "variety", "from_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["item_id", 10], ["variety", 1], ["from_user_id", 102], ["created_at", "2020-12-14 14:05:24.596914"], ["updated_at", "2020-12-14 14:05:24.596914"]]
UPDATE "users" SET "notification" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["notification", 1], ["updated_at", "2020-12-14 14:05:24.610325"], ["id", 1]]
---
  def create
    @item = Item.find(params[:item_id])
    @user = @item.user
    current_user.favorite(@item)
    respond_to do |format|
      format.html { redirect_to request.referrer || root_url }
      format.js
    end
    # 自分以外のユーザーからお気に入り登録があったときのみ通知を作成
    if @user != current_user
      @user.notifications.create(item_id: @item.id, variety: 1,
                                 from_user_id: current_user.id) # お気に入り登録は通知種別1
      @user.update_attribute(:notification, true)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."created_at" DESC LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 7]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."item_id" = ? ORDER BY "favorites"."created_at" DESC LIMIT ?  [["user_id", 102], ["item_id", 10], ["LIMIT", 1]]
---
  def destroy
    @item = Item.find(params[:item_id])
    current_user.favorites.find_by(item_id: @item.id).destroy