app/controllers/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."created_at" DESC LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def show
    @item = Item.find(params[:id])

INSERT INTO "items" ("name", "point", "reference", "buy_memo", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "test"], ["point", ""], ["reference", ""], ["buy_memo", ""], ["user_id", 103], ["created_at", "2020-12-15 02:50:43.067897"], ["updated_at", "2020-12-15 02:50:43.067897"]]
---
  def create
    @item = current_user.items.build(item_params)
    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."created_at" DESC LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def edit
    @item = Item.find(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."created_at" DESC LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def update
    @item = Item.find(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."created_at" DESC LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 12]]
---
  def destroy
    @item = Item.find(params[:id])
    if current_user.admin? || current_user?(@item.user)
      @item.destroy

SELECT  "items".* FROM "items" WHERE "items"."user_id" = ? AND "items"."id" = ? ORDER BY "items"."created_at" DESC LIMIT ?  [["user_id", 1], ["id", 12], ["LIMIT", 1]]
---
    def correct_user
      # 現在のユーザーが更新対象のアイテムを保有しているかどうか確認
      @item = current_user.items.find_by(id: params[:id])