app/controllers/items_controller.rb

INSERT INTO "logs" ("item_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["item_id", 16], ["content", ""], ["created_at", "2020-12-18 12:17:20.875173"], ["updated_at", "2020-12-18 12:17:20.875173"]]
---
  def create
    @item = current_user.items.build(item_params)
    if @item.save
      flash[:success] = "アイテムが登録されました！"
      Log.create(item_id: @item.id, content: @item.buy_memo)