app/controllers/lists_controller.rb

  def create
    @item = Item.find(params[:item_id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."created_at" DESC LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def destroy
    list = List.find(params[:list_id])
    @item = list.item
    list.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? ORDER BY "lists"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]