app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @items = @user.items.paginate(page: params[:page], per_page: 5)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."user_id" = ? ORDER BY "items"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params_update)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "introduction" = ?, "sex" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Edit Example User"], ["email", "edit-user@example.com"], ["introduction", "編集：初めまして"], ["sex", "編集：男性"], ["updated_at", "2020-12-08 04:10:33.615729"], ["id", 1]]

  def destroy
    @user = User.find(params[:id])
    # 管理者ユーザーの場合
    if current_user.admin?
      @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]