app/models/user.rb

  def followed_by?(other_user)
    followers.include?(other_user)
---
SELECT  1 AS one FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."followed_id" WHERE "relationships"."follower_id" = ? AND "users"."id" = ? LIMIT ?  [["follower_id", 1], ["id", 3], ["LIMIT", 1]]

  def favorite(item)
    Favorite.create!(user_id: id, item_id: item.id)
---
INSERT INTO "favorites" ("user_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["item_id", 10], ["created_at", "2020-12-16 11:03:40.640631"], ["updated_at", "2020-12-16 11:03:40.640631"]]

  def favorite?(item)
    !Favorite.find_by(user_id: id, item_id: item.id).nil?
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."item_id" = ? ORDER BY "favorites"."created_at" DESC LIMIT ?  [["user_id", 1], ["item_id", 10], ["LIMIT", 1]]

  def list(item)
    List.create!(user_id: item.user_id, item_id: item.id, from_user_id: id)
---
INSERT INTO "lists" ("user_id", "item_id", "from_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["item_id", 10], ["from_user_id", 1], ["created_at", "2020-12-15 00:51:22.641525"], ["updated_at", "2020-12-15 00:51:22.641525"]]

  def list?(item)
    !List.find_by(item_id: item.id, from_user_id: id).nil?
---
SELECT  "lists".* FROM "lists" WHERE "lists"."item_id" = ? AND "lists"."from_user_id" = ? ORDER BY "lists"."created_at" DESC LIMIT ?  [["item_id", 10], ["from_user_id", 1], ["LIMIT", 1]]